In [20]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

In [21]:
df = pd.read_csv('data/test.csv')
train = pd.read_csv('data/train.csv')
train['Embarked'] = train['Embarked'].replace({'C': 1, 'Q': 2, 'S': 3})
example = pd.read_csv('data/gender_submission.csv')


scaler = MinMaxScaler()
train['Fare'] = scaler.fit_transform(train[['Fare']])

C:\Users\admin\AppData\Local\Temp\ipykernel_13904\677219927.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  train['Embarked'] = train['Embarked'].replace({'C': 1, 'Q': 2, 'S': 3})

In [22]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0.014151,NaN,3.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,0.139136,C85,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0.015469,NaN,3.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0.103644,C123,3.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,0.015713,NaN,3.0

In [16]:
del train['Ticket']
del train['Cabin']
del train['Name']
del train['PassengerId']

In [10]:
train[train['Embarked'].isna()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [9]:
train['Embarked'].fillna(1, inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_13904\1276412094.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train['Embarked'].fillna(1, inplace=True)

In [141]:
train[(train['Sex']=='male') & (train['Survived'] == 1)]['Age'].mean()

27.276021505376345

In [142]:
male_df = train[train['Sex']== 'male']
male_survied_class = male_df.groupby('Pclass')['Survived'].sum()
male_survied_class

Pclass
1    45
2    17
3    47
Name: Survived, dtype: int64

In [143]:
female_df = train[train['Sex'] == 'female']
female_survied_class = female_df.groupby('Pclass')['Survived'].sum()
female_survied_class

Pclass
1    91
2    70
3    72
Name: Survived, dtype: int64

In [144]:
female_pclass3_life = female_df[(female_df['Pclass']==3) & (female_df['Survived']==1)]
del female_pclass3_life['Survived']
del female_pclass3_life['Pclass']

female_pclass3_life.describe()

             Age      SibSp      Parch       Fare   Embarked
count  47.000000  72.000000  72.000000  72.000000  72.000000
mean   19.329787   0.500000   0.500000  12.464526   2.250000
std    12.303246   0.888106   0.919277   5.984714   0.782736
min     0.750000   0.000000   0.000000   7.225000   1.000000
25%    13.500000   0.000000   0.000000   7.750000   2.000000
50%    19.000000   0.000000   0.000000   9.468750   2.000000
75%    26.500000   1.000000   1.000000  15.912500   3.000000
max    63.000000   4.000000   5.000000  31.387500   3.000000

In [145]:
female_pclass3_dead = female_df[(female_df['Pclass']==3) & (female_df['Survived']==0)]

del female_pclass3_dead['Survived']
del female_pclass3_dead['Pclass']

female_pclass3_dead.describe()

             Age      SibSp      Parch       Fare   Embarked
count  55.000000  72.000000  72.000000  72.000000  72.000000
mean   23.818182   1.291667   1.097222  19.773093   2.652778
std    12.833465   1.902093   1.435562  14.572275   0.674688
min     2.000000   0.000000   0.000000   6.750000   1.000000
25%    15.250000   0.000000   0.000000   8.531250   3.000000
50%    22.000000   1.000000   1.000000  14.479150   3.000000
75%    31.000000   1.250000   2.000000  26.075025   3.000000
max    48.000000   8.000000   6.000000  69.550000   3.000000

In [146]:
female_pclass3_dead[female_pclass3_dead["Embarked"] == 3].count()

Sex         55
Age         45
SibSp       55
Parch       55
Fare        55
Embarked    55
dtype: int64

In [149]:
male_df
male_life = male_df[male_df['Survived'] == 1]
male_dead = male_df[male_df['Survived'] == 0]

In [150]:
male_dead.describe()

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked
count,468.0,468.000000,360.000000,468.000000,468.000000,468.000000,468.000000
mean,0.0,2.476496,31.618056,0.440171,0.207265,21.960993,2.636752
std,0.0,0.761411,14.056019,1.138507,0.601382,32.409799,0.717251
min,0.0,1.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,0.0,2.000000,21.750000,0.000000,0.000000,7.795800,3.000000
50%,0.0,3.000000,29.000000,0.000000,0.000000,9.416650,3.000000
75%,0.0,3.000000,39.250000,0.000000,0.000000,26.000000,3.000000
max,0.0,3.000000,74.000000,8.000000,5.000000,263.000000,3.000000

In [151]:
male_life.describe()

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked
count,109.0,109.000000,93.000000,109.000000,109.000000,109.000000,109.000000
mean,1.0,2.018349,27.276022,0.385321,0.357798,40.821484,2.440367
std,0.0,0.922774,16.504803,0.636952,0.645826,71.355967,0.886433
min,1.0,1.000000,0.420000,0.000000,0.000000,0.000000,1.000000
25%,1.0,1.000000,18.000000,0.000000,0.000000,9.500000,1.000000
50%,1.0,2.000000,28.000000,0.000000,0.000000,26.287500,3.000000
75%,1.0,3.000000,36.000000,1.000000,1.000000,39.000000,3.000000
max,1.0,3.000000,80.000000,4.000000,2.000000,512.329200,3.000000

In [153]:
male_life[male_life['SibSp'] > 263].count()

Survived    107
Pclass      107
Sex         107
Age          91
SibSp       107
Parch       107
Fare        107
Embarked    107
dtype: int64

In [158]:
male_dead.groupby('Embarked').count()

          Survived  Pclass  Sex  Age  SibSp  Parch  Fare
Embarked
1.0             66      66   66   45     66     66    66
2.0             38      38   38   15     38     38    38
3.0            364     364  364  300    364    364   364